{
    "0" : {
        "name" : "Call of Duty",
        "description" : ["Call of Duty® delivers the gritty realism and cinematic intensity of World War II's epic battlefield moments like never before - through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history.", "Play through the chaos of battle as part of a well-trained squad, that lays down covering fire and pulls its wounded to safety. In addition to authentic squad movements and tactics, each soldier's distinct personality and training comes out on the battlefield.<br/>No one soldier or nation single-handedly won the war. For the first time, Call of Duty® captures the war from multiple perspectives, through the eyes of American, British and Russian soldiers. Battle through 24 missions spanning 4 interconnected historical campaigns. Take on mission objectives ranging from sabotage and all-out assault to stealth, vehicle combat and rescue. Authentic weapons, locations, vehicles and sounds of war all contribute to the realism, immersing you in the most intense World War II experience yet.", "© 2003 Activision Publishing, Inc. Activision and Call of Duty are registered trademarks of Activision Publishing, Inc. All rights reserved. All other trademarks and trade names are the properties of their respective owners."],
        "price" : 14.99,
        "logo" : "images/call-of-duty-logo.png",
        "release" : "29/10/2003"
    },
    "1" : {
        "name" : "Call of Duty: United Offensive",
        "description" : ["Award-winning developer Gray Matter Interactive follows up on the success of Infinity Ward's Call of Duty™ - winner of over 80 Game of the Year and 50 Editors' Choice awards worldwide - with Call of Duty™: United Offensive™. Take the role of American, British, and Russian soldiers in some of the most climactic battles of World War II, including the Battle of the Bulge, the invasion of Sicily, and the Battle of Kursk.", "Fight in tanks, jeeps, motorcycles, even a bomber. Work with your squad through snow and rain, using new weapons including flamethrowers and deployable machine guns, or by calling in artillery strikes. 13 All-New Single Player missions spanning three campaigns. 11 exciting new Multiplayer maps and 3 new multiplayer modes including Domination, Capture the Flag, and Base Assault.", "© 2006 Activision Publishing, Inc. Activision and Call of Duty are registered trademarks of Activision Publishing, Inc. All rights reserved. All other trademarks and trade names are the properties of their respective owners."],
        "price" : 14.99,
        "logo" : "images/call-of-duty-uo.png",
        "release" : "15/09/2004"
    },
    "2" : {
        "name" : "Call of Duty 2",
        "description" : ["Call of Duty® 2 redefines the cinematic intensity and chaos of battle as seen through the eyes of ordinary soldiers fighting together in epic WWII conflicts. The sequel to 2003's Call of Duty, winner of over 80 Game of the Year awards, Call of Duty 2 offers more immense, more intense, more realistic battles than ever before, thanks to the stunning visuals of the new COD™2 engine.", "The #1 WWII shooter development team returns with an amazing new experience: Developed by Infinity Ward, creators of the award-winning Call of Duty. All-new, unprecedented enhancements from stunningly realistic graphics to seamless gameplay, thanks to the revolutionary COD2 engine, groundbreaking AI, and choice-based gameplay innovations. Beautifully rendered snow, rain, fog, and smoke, combined with dynamic lighting and shadows, make this the most intense WWII shooter yet.", "New conflicts and enemies to face: Call of Duty 2 brings you bigger battles, with more tanks, troops, and explosions on-screen, and bigger scope, with a wide range of locales and environments across the European Theater. Fight \"The Desert Fox\" across the scorching sands of North Africa as wave upon wave of tanks clash in the desert. Use rocket-propelled grappling hooks alongside your Army Ranger squad to storm and scale the cliffs of Pointe du Hoc against a relentless German counterassault, and slog through urban chaos as a tank hunter in war-torn Russia.", "Rely on your squad as never before: The dozens of Allied soldiers surrounding you are fully aware of the changing situations around them, and will let you know using an all-new, context-sensitive battle chatter system. They will draw enemy fire, lay down cover for you, use foxholes and moving tanks for cover, and warn you of incoming enemy troops and hostile fire.", "Choice-based gameplay: Play through missions in the order you see fit. Will you decide to play first as a sniper or as a tank commander? It's your call. Open-ended battlefields allow you to individualize your tactics and choose the order in which you complete your objectives.", "Multiplayer Mayhem: Go online for intense Axis vs. Allies team-based multiplayer action, building on the hugely popular Call of Duty multiplayer modes."],
        "price" : 14.99,
        "logo" : "images/call-of-duty-2.png",
        "release" : "25/10/2005"
    },
    "3" : {
        "name" : "Call of Duty 4: Modern Warfare",
        "description" : ["The new action-thriller from the award-winning team at Infinity Ward, the creators of the Call of Duty® series, delivers the most intense and cinematic action experience ever. Call of Duty 4: Modern Warfare arms gamers with an arsenal of advanced and powerful modern day firepower and transports them to the most treacherous hotspots around the globe to take on a rogue enemy group threatening the world.", "As both a U.S Marine and British S.A.S. soldier fighting through an unfolding story full of twists and turns, players use sophisticated technology, superior firepower and coordinated land and air strikes on a battlefield where speed, accuracy and communication are essential to victory. The epic title also delivers an added depth of multiplayer action providing online fans an all-new community of persistence, addictive and customizable gameplay.", "Authentic Advanced Weaponry - Featuring an available arsenal of more than 70 new and authentic weapons and gear from assault rifles with laser sites, claymore mines, .50 caliber sniper rifles, and M-249 SAW machine guns. With accessories like night-vision goggles and ghillie suits, for maximum concealment, Call of Duty 4: Modern Warfare has players locked and loaded to accomplish the mission.", "Coordinated Assault and Support - Delivering the most visceral action thriller ever, the title covers modern battle from the soldier to the satellite, where the need for air support is critical to success. The adrenaline rush deployment enlists gamers to fast-rope from tactical helicopters, ride in an armada of attack choppers, utilize jets to remove enemy strongholds and even engage hostiles from thousands of feet above the ground inside a state of the art aerial gunship.", "Cinematic Quality Graphics and Sound - Featuring stunning next-generation graphics, players will be drawn into the cinematic intensity of Call of Duty 4: Modern Warfare. Amazing special effects, including realistic depth of field, rim-lighting, character self-shadowing, texture streaming as well as physics-enabled effects will enlist players into the most photo-realistic gaming experience. Combine the lifelike graphics and the realistic battle chatter with the Call of Duty award-winning sound design and players will face battle as they have never before.", "Unparalleled Depth to Multiplayer - Multiplayer builds from the success of Call of Duty 2 delivering a persistent online experience for greater community interaction. Featuring create-a-class options allowing players to customize gear that is best suited for play, to experience points enabling unlockables and perks, all the way to matchmaking and leaderboards for the latest in tracking, Call of Duty 4: Modern Warfare's multiplayer is set to deliver easily accessible and addictive online play for all."],
        "price" : 19.99,
        "logo" : "images/call-of-duty-4.png",
        "release" : "12/11/2007"
    },
    "4" : {
        "name" : "Call of Duty: World at War",
        "description" : ["Call of Duty is back, redefining war like you've never experienced before. Building on the Call of Duty 4®: Modern Warfare engine, Call of Duty: World at War immerses players into the most gritty and chaotic WWII combat ever experienced. Players band together to survive the most harrowing and climactic battles that led to the demise of the Axis powers on the European and Pacific fronts. The title offers an uncensored experience with unique enemies and combat variety, including Kamikaze fighters, ambush attacks, Banzai charges and cunning cover tactics, as well as explosive on-screen action through the all new four-player cooperative campaign. The addictive competitive multiplayer has also been enhanced with new infantry and vehicle-based action, a higher level cap, more weapons, and a host of new Perks, maps and challenges.", "Harsh New Enemies, Environments and Tactics: Face off against ruthless and tactically advanced enemies that will stop at nothing to defend their homelands, from swamp ambushes and tree-top snipers to fearless Kamikaze attacks. Play as a U.S. Marine and Russian conscript across a variety of Pacific and European locations against the fearless Imperial Japanese and elite German soldiers in epic adrenaline-filled infantry, vehicle and airborne missions.", "Co-Op Campaign Mode, Call of Duty Style: For the first time in the franchise, Call of Duty: World at War introduces co-op play, bringing fresh meaning to No One Fights Alone. Campaign co-op features up to four-players online, allowing gamers to experience harrowing campaign missions together for greater camaraderie and tactical execution. Co-op mode incorporates innovative multiplayer components such as challenges, rankings and online stats for deeper re-playability and multiplayer experience bonuses. Co-op mode also features Competitive Co-Op that will show who is really the best player on your team.", "Enhanced Innovative Multiplayer: Call of Duty: World at War continues the addictive class-based multiplayer action the series is famous for. The addition of vehicle combat with tanks rounds out the highly-successful Call of Duty 4: Modern Warfare multiplayer experience, and features such as persistent stats, player rankings, upgradeable weapons, squad-based gameplay, customizable classes and Perks, have been further enhanced to set a new standard in Call of Duty online warfare.", "Unprecedented Cinematic Quality in a World at War: Built using the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War utilizes cutting-edge technology including highly-detailed character models, self-shadowing, environmental lighting and amazing special effects to deliver jaw-dropping visuals. Depth of field, rim-lighting and texture-streaming technology bring the adrenaline-pumping combat to life, while physics-enabled battlefields and fire that spreads through environments realistically, immerses players into the harrowing and dynamic combat."],
        "price" : 19.99,
        "logo" : "images/call-of-duty-waw.png",
        "release" : "18/11/2008"
    },
    "5" : {
        "name" : "Call of Duty: Modern Warfare 2",
        "description" : ["The most-anticipated game of the year and the sequel to the best-selling first-person action game of all time, Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse.", "Call of Duty®: Modern Warfare 2 features for the first time in video games, the musical soundtrack of legendary Academy Award®, Golden Globe® Award, Grammy® Award and Tony winning composer Hans Zimmer. The title picks up immediately following the historic events of Call of Duty® 4: Modern Warfare®, the blockbuster title that earned worldwide critical acclaim, including:", "Most Played Online Video Game in history, 2009 Guinness World Records", "More than 50 Game of the Year awards, including the Console Game of the Year and Overall Game of the Year, 2007, from the Academy of Interactive Arts & Sciences®", "SPECIAL OPS CO-OPERATIVE", "An entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player story campaign.", "Special Ops pits players into a gauntlet of time-trial and objective-based missions.", "Rank-up as players unlock new Special Ops missions, each more difficult.", "Missions include highlights from the single player campaign, fan favorites from Call of Duty 4: Modern Warfare and all new, exclusive missions.", "MULTIPLAYER REINVENTED", "Setting a new bar for online multiplayer, Modern Warfare 2 multiplayer delivers new capabilities, customization, gamestates and modes, including:", "Create-a-Class Evolved", "Secondary Weapons - Machine Pistols, Shotguns, Handguns, Launchers", "Riot Shields", "Equipment - Throwing Knives, Blast Shield, Tactical Insertion", "Perk Upgrades", "Bling (Dual Attachments)", "Customizable Killstreaks - AC130, Sentry Gun, Predator Missile, Counter-UAV, Care Package", "Accolades (Post match reports)"],
        "price" : 19.99,
        "logo" : "images/call-of-duty-mw2.png",
        "release" : "12/11/2009"
    },
    "6" : {
        "name" : "Call of Duty: Black Ops",
        "description" : ["The biggest first-person action series of all time and the follow-up to last year’s blockbuster Call of Duty®: Modern Warfare 2 returns with Call of Duty®: Black Ops.", "Call of Duty®: Black Ops will take you behind enemy lines as a member of an elite special forces unit engaging in covert warfare, classified operations, and explosive conflicts across the globe. With access to exclusive weaponry and equipment, your actions will tip the balance during the most dangerous time period mankind has ever known.", "Key Features:", "Cinematic Single Player Campaign: An epic campaign and story that takes you to a variety of locations and conflicts all over the world where you will play as an elite Black Ops soldier in deniable operations where if you are caught, captured or killed, your country will disavow all knowledge of your existence.", "Signature Multiplayer: Call of Duty’s signature multiplayer gameplay returns with new perks and killstreaks, deeper levels of character and weapon customization, and all new modes including:", "Wager Matches: One in the Chamber, Gun Game, Sticks and Stones, Sharpshooter", "Theater Mode: View, record, and edit your favorite moments from multiplayer, and share with your friends", "Combat Training: Test your skill solo or Co-Op with friends against AI enemy players", "Zombies!: Fan favorite Zombie mode is back providing endless hours of Zombie-slaying entertainment, solo or Co-Op"],
        "price" : 29.99,
        "logo" : "images/call-of-duty-bo.png",
        "release" : "9/11/2010"
    },
    "7" : {
        "name" : "Call of Duty: Modern Warfare 3",
        "description" : ["The best-selling first person action series of all-time returns with the epic sequel to multiple “Game of the Year” award winner, Call of Duty®: Modern Warfare® 2. In the world’s darkest hour, are you willing to do what is necessary? Prepare yourself for a cinematic thrill-ride only Call of Duty can deliver. The definitive Multiplayer experience returns bigger and better than ever, loaded with new maps, modes and features. Co-Op play has evolved with all-new Spec-Ops missions and leaderboards, as well as Survival Mode, an action-packed combat progression unlike any other."],
        "price" : 29.99,
        "logo" : "images/call-of-duty-mw3.png",
        "release" : "8/11/2011"
    },
    "8" : {
        "name" : "Call of Duty: Black Ops 2",
        "description" : ["Pushing the boundaries of what fans have come to expect from the record-setting entertainment franchise, Call of Duty®: Black Ops II propels players into a near future, 21st Century Cold War, where technology and weapons have converged to create a new generation of warfare."],
        "price" : 29.99,
        "logo" : "images/call-of-duty-bo2.png",
        "release" : "12/11/2012"
    },
    "9" : {
        "name" : "Call of Duty: Ghosts",
        "description" : ["Outnumbered and outgunned, but not outmatched.", "Call of Duty®: Ghosts is an extraordinary step forward for one of the largest entertainment franchises of all-time. This new chapter in the Call of Duty® franchise features a new dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive.", "Fueling this all new Call of Duty experience, the franchise's new next-gen engine delivers stunning levels of immersion and performance, all while maintaining the speed and fluidity of 60 frames-per-second across all platforms.", "Single Player Campaign", "Ten years after a devastating mass event, America’s borders and the balance of global power have changed forever. As what's left of the nation's Special Operations forces, a mysterious group known only as \"Ghosts\" leads the fight back against a newly emerged, technologically-superior global power.", "A New Call of Duty Universe: For the first time in franchise history, players will take on the underdog role with Call of Duty: Ghosts; outnumbered and outgunned, players must fight to reclaim a fallen nation in an intensely personal narrative. Gamers will get to know an entirely new cast of characters and visit locales in a changed world unlike anything seen in Call of Duty® before.", "Multiplayer", "In Call of Duty: Ghosts you don't just create a class, you create a soldier, a first for the franchise. In the new Create-A-Soldier system, players can change the physical appearance of their soldier by choosing the head, body type, head-gear and equipment, and for the first time in a Call of Duty® game, the player can also choose their gender. With 20,000 possible combinations, this is the most flexible and comprehensive character customization in Call of Duty history.", "New dynamic maps are the evolution of multiplayer. They include interactive elements and player triggered events that make the environment evolve as each match goes on. The entire landscape can shift and force players to change tactics and strategies.", "Call of Duty: Ghosts introduces new tactical player movements. The new contextual lean system now allows players to lean around obstacles without adding button combinations or fully leaving cover. The new mantling system allows fluid movement over objects, while maintaining momentum. The knee slide allows for a natural transition from sprinting crouching to prone.", "Call of Duty: Ghosts delivers over 20 NEW Kill Streaks such as Juggernaut Maniac, the Helo Scout, the Vulture and the ODIN Strike. Players can even bring in guard dog Riley, from the single-player campaign, to protect and also to attack enemies. There are also over 30 NEW weapons, including an entirely new weapon class: Marksman Rifles.", "Squads", "Build your team and take up to 6 of them into battle in the all new Squads mode. This mode takes the best parts of the multiplayer experience and allows you to play either solo or cooperatively with the custom soldiers created and leveled up in multiplayer.", "The load-out choices you make for your Squad members will directly change the AI behavior of your squad-mates. Give your soldier a sniper rifle and he'll behave like a sniper, and an SMG guy will be more run and gun."],
        "price" : 29.99,
        "logo" : "images/call-of-duty-ghosts.png",
        "release" : "25/03/2014"
    },
    "10" : {
        "name" : "Call of Duty: Advanced Warfare",
        "description" : ["Call of Duty®: Advanced Warfare, developed by Sledgehammer Games (co-developers of Call of Duty®: Modern Warfare® 3), harnesses the first three-year, all next-gen development cycle in franchise history. Call of Duty®: Advanced Warfare envisions a powerful future, where both technology and tactics have evolved to usher in a new era of combat for the franchise. Delivering a stunning performance, Academy Award® winning actor Kevin Spacey stars as Jonathan Irons - one of the most powerful men in the world - shaping this chilling vision of the future of war.", "All digital purchases of Call of Duty: Advanced Warfare include the bonus Digital Edition Personalization Pack with a custom weapon camo, reticle set and playercard.", "Power Changes Everything.", "An Advanced World", "Call of Duty: Advanced Warfare takes place in a plausible future in which technological progress and today’s military practices have converged with powerful consequences.", "In this carefully researched and crafted vision, Private Military Corporations (PMCs) have become the dominant armed forces for countless nations outsourcing their military needs, redrawing borders and rewriting the rules of war.", "And Jonathan Irons, the founder and president of the world’s largest PMC - Atlas Corporation - is at the center of it all.", "An Advanced Soldier", "Powerful exoskeletons evolve every aspect of a soldier’s battle readiness, enabling combatants to deploy with an advanced lethality and eliminating the need for specialization.", "The introduction of this gameplay mechanic delivers enhanced player movement and verticality through boost jumps and grappling, covert cloaking abilities, and biomechanics that provide unparalleled strength, awareness, endurance, and speed.", "With the advent of the exoskeleton and newly advanced armor and weaponry, every soldier commands tactical freedom in any terrain unlike ever before, fundamentally changing the way gamers play Call of Duty across all modes.", "An Advanced Arsenal", "Harnessing the power of next-gen platforms, Call of Duty: Advanced Warfare introduces a new hi-tech, advanced arsenal and ability set, arming players with all-new equipment, technology, perks, and vehicles like hoverbikes and highly specialized drones.", "Players can also choose between standard ammunition and an all-new class of directed-energy weaponry that enables totally new gameplay dynamics.", "And with exoskeletons delivering a massive force multiplier and unprecedented tactical freedom, Call of Duty: Advanced Warfare evolves every firefight."],
        "price" : 39.99,
        "logo" : "images/call-of-duty-aw.png",
        "release" : "03/11/2014"
    },
    "11" : {
        "name" : "Call of Duty: Black Ops 3",
        "description" : ["Treyarch, developer of the two most-played games in Call of Duty® history, returns with Call of Duty®: Black Ops III. For the first time with three-years of development, the revered, award-winning studio has created its first title for next-gen hardware in the critically acclaimed Black Ops series. Welcome to Call of Duty: Black Ops 3, a dark, twisted future where a new breed of Black Ops soldier emerges and the lines are blurred between our own humanity and the technology we created to stay ahead, in a world where cutting-edge military robotics define warfare.", "Call of Duty: Black Ops 3 combines three unique game modes: Campaign, Multiplayer and Zombies, providing fans with the deepest and most ambitious Call of Duty ever. The Campaign has been designed as a co-op game that can be played with up to 4 players online or as a solo cinematic thrill-ride. Multiplayer will be the franchise’s deepest, most rewarding and most engaging to date, with new ways to rank up, customize, and gear up for battle. And Zombies delivers an all-new mind-blowing experience with its own dedicated narrative. Call of Duty: Black Ops 3 can be played entirely online, and for the first time each of the offerings has its own unique player XP and progression systems. The title ushers in an unprecedented level of innovation, including jaw-dropping environments, never before experienced weaponry and abilities, and the introduction of a new, improved fluid movement system. All of this is brought to life by advanced technology custom crafted for this title, including new AI and animation systems, and graphics that redefine the standards Call of Duty fans have come to expect from the critically-acclaimed series, with cutting edge lighting systems and visual effects.", "INTRODUCING A NEW ERA OF BLACK OPS:", "Call of Duty: Black Ops 3 deploys its players into a future where bio-technology has enabled a new breed of Black Ops soldier. Players are now always on and always connected to the intelligence grid and their fellow operatives during battle. In a world more divided than ever, this elite squad consists of men and women who have enhanced their combat capabilities to fight faster, stronger, and smarter. Every soldier has to make difficult decisions and visit dark places in this engaging, gritty narrative.", "A CALL OF DUTY CAMPAIGN UNLIKE ANYTHING BEFORE IT:", "Treyarch elevates the Call of Duty social gaming experience by delivering a campaign with the ability to play cooperatively with up to four players online, using the same battle-tested network infrastructure and social systems that support its world-class Multiplayer and Zombies game modes. Designed for co-op and re-playability, players encounter all the epic cinematic gameplay moments Call of Duty is known for delivering as well as new open-area arena-style gameplay elements designed to allow players to approach the game with a different strategy each time they play. And now, every player is completely customizable: from weapons and loadouts, to abilities and outfits, all with full progression systems and a personalized armory to show off accomplishments, providing a constantly-evolving campaign experience.", "PREPARE FOR A LEVELED-UP MULTIPLAYER:", "With Black Ops 3, Treyarch premieres a new momentum-based chained-movement system, allowing players to fluidly move through the environment with finesse, using controlled thrust jumps, slides, and mantling abilities in a multitude of combinations, all while maintaining complete control over your weapon at all times. Maps are designed from the ground-up for the new movement system, allowing players to be successful with traditional movement, as well as advanced tactics and maneuvers.", "Black Ops 3 multiplayer also introduces the new Specialist character system, which allows players to rank up and master each specific character’s battle-hardened capabilities and weapons. With this addition to Traditional and Weapons XP progressions systems, Black Ops 3 multiplayer gives players three different ways to rank up.", "FIGHT THE UNDEAD IN AN ALL-NEW HORROR STORY:", "No Treyarch title would be complete without its signature Zombies offering – a full-game experience with its own distinct storyline right out of the box. Black Ops 3 Zombies is the most immersive and ambitious Call of Duty Zombies to date, with a full XP-based progression system for players that adds depth and re-playability to the engaging gameplay Zombies fans have come to expect.", "Call of Duty: Black Ops 3 delivers the ultimate 3-games-in-1 experience."],
        "price" : 39.99,
        "logo" : "images/call-of-duty-bo3.png",
        "release" : "06/11/2015"
    },
    "12" : {
        "name" : "Call of Duty: Infinite Warfare",
        "description" : ["Includes the Terminal Bonus Map and Zombies in Spaceland Pack, contains a weapon camo, calling card, and a Fate and Fortune Card Pack!", "Infinite Warfare delivers three unique game modes: Campaign, Multiplayer, and Zombies.", "In Campaign, players play as Captain Reyes, a pilot turned Commander, who must lead the remaining coalition forces against a relentless, fanatical enemy, while trying to overcome the deadly, extreme environments of space.", "Multiplayer combines a fluid momentum based movement system, player focused map design, deep customization, and a brand new combat rig system to create an intense gameplay experience where every second counts. Combat Rigs (Rigs) are the ultimate combat systems. Each Rig is a cutting-edge, tactical combat suit worn by the player and is built for totally different styles of play. Players will also join one of four brand-new Mission Teams to unlock calling cards, camos, emblems, and weapons unique to that team.", "In Zombies, go back in time to fight the undead in a 1980s amusement park, complete with a plethora of rides, an awesome arcade, and a funky, functioning rollercoaster. Embrace previously beloved aspects of the mode like easter eggs, power ups, and novel weapons while experiencing innovations like brand-new team mechanics, the After Life Arcade, and Fate and Fortune Cards."],
        "price" : 39.99,
        "logo" : "images/call-of-duty-iw.png",
        "release" : "04/11/2015"
    }
}